{"post_stream":{"posts":[{"id":18865,"name":"","username":"slapin","avatar_template":"https://avatars.discourse-cdn.com/v4/letter/s/dfb087/{size}.png","created_at":"2017-06-20T22:33:10.529Z","cooked":"\u003cp\u003eHi, all!\u003c/p\u003e\n\u003cp\u003eI asked my gaming friends about what would open-world game which would be popular and would\u003cbr\u003e\nnot be annoying/butthurtful. That is what I gathered:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eThe game should be possible to fastrun in under 5 hours. Otherwise the motivation is lost and game left unfinished.\u003c/li\u003e\n\u003cli\u003eIngame text reading should not be required to complete game and get good ending; the reading might be rewarded\u003cbr\u003e\nby extra content or story depth, though.\u003c/li\u003e\n\u003cli\u003eThe locations should be small enough and should be memorable enough so that additional navigation helpers are not needed. But the tools should still be available. Labyrinths and navugation-based puzzles are the reason to drop game and never come back.\u003c/li\u003e\n\u003cli\u003eHUD should not contain directions in text form, nobody reads them, and it is annoying to find-out that directions were written on screen, people don’t like feeling stupid.\u003c/li\u003e\n\u003cli\u003eAll puzzles should be tested on various people; most buying audience prefer to skip puzzles. They might be fun as optional gameplay element though. People don’t like feeling stupid. Also youtube will make puzzles useless; randomized puzzles not usable with youtube will make game incompletable for large audience percentage.\u003c/li\u003e\n\u003cli\u003eLong game hours and replayability is a myth; Best games are completed under 5 hours and never played again,\u003cbr\u003e\nwith driven and accomplishment feeling; it is too rare to find really replayable game, so why bother.\u003c/li\u003e\n\u003cli\u003ePlayer likes predictable gameplay; player is quickly tired of predictable gameplay. Don’t torture players, make games short\u003c/li\u003e\n\u003cli\u003eWhile players say they like challenges, they actually don’t. But they should feel the challenge, even though there isn’t. Also they’are to be rewarded for it by even less challenge. Players don’t like and easily notice “balanced” games; The balance should be a part of game design, not added later. But still, everybody likes powerups as indication there is tough fight nearby, but thisone is too cliched; something new in casual shooters/survival horrors would be highly welcome.\u003c/li\u003e\n\u003cli\u003eIf one does some animations good and some half-assed, it is noticeable by player and is annoying; also it is annoying when good model is animated badly. But if you do everything on the same level, people are happy. So\u003cbr\u003e\nif you don’t have enough time for animations don’t bother modelling well. Also don’t buy pre-made great looking models\u003cbr\u003e\nif you can’t make animations required for game. Just make your ugly models with ugly animations. If your plot is good,\u003cbr\u003e\nplayer will conseder it a part of style, not half-assed job. Especially if you put your soul into it.\u003c/li\u003e\n\u003cli\u003eDon’t bother making any adventure games; they won’t sell. Also if you’re not huge company with a lot of resources,\u003cbr\u003e\ndon’t bother with RPGs either. Just do a new casual shooter with new setting, they always sell. Also you save on engine, you don’t need to add new code for a new game.\u003c/li\u003e\n\u003cli\u003eDon’t make gameplay complicated - too many possibilities will make game too scary for players. There is very little players who like a lot of controls. Also large worlds have the same effect. And people hate walking simulators.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eWell, understanding this, I see that if one wants to get $$$ he will make casual shooter\u003cbr\u003e\nIf one wants to have fun he will do whatever he wants. As I understand, the more annoying the gameplay is,\u003cbr\u003e\nthe more fun it is for developers. So if one wants to experiment, he have a great field of possibilities.\u003cbr\u003e\nBut if one have budgets and wants to make money off them they have to obey strict constraints. So high-budget games which are not in casual shooter genre should be considered innovative investment in industry and praised\u003cbr\u003e\nas the ones which actually move the progress.\u003c/p\u003e","post_number":1,"post_type":1,"updated_at":"2017-06-20T22:33:10.529Z","reply_count":1,"reply_to_post_number":null,"quote_count":0,"incoming_link_count":42,"reads":58,"readers_count":57,"score":226.6,"yours":false,"topic_id":3271,"topic_slug":"open-world-games","display_username":"","primary_group_name":null,"flair_name":null,"flair_url":null,"flair_bg_color":null,"flair_color":null,"version":1,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"read":true,"user_title":null,"bookmarked":false,"actions_summary":[],"moderator":false,"admin":false,"staff":false,"user_id":554,"hidden":false,"trust_level":2,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":false,"can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false},{"id":18875,"name":"Eugene Kozlov","username":"Eugene","avatar_template":"/user_avatar/discourse.urho3d.io/eugene/{size}/902_2.png","created_at":"2017-06-21T12:43:38.650Z","cooked":"\u003caside class=\"quote no-group\" data-username=\"slapin\" data-post=\"1\" data-topic=\"3271\"\u003e\n\u003cdiv class=\"title\"\u003e\n\u003cdiv class=\"quote-controls\"\u003e\u003c/div\u003e\n\u003cimg alt=\"\" width=\"20\" height=\"20\" src=\"https://avatars.discourse-cdn.com/v4/letter/s/dfb087/40.png\" class=\"avatar\"\u003e slapin:\u003c/div\u003e\n\u003cblockquote\u003e\n\u003cp\u003eLong game hours and replayability is a myth;\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003c/aside\u003e\n\u003cp\u003eDisagree. If game mechanic is deep enough and game have at least co-op, replayability could be almost infinity.\u003cbr\u003e\nI know few games that I can episodically play (but only Terraria is open-world in this list)\u003c/p\u003e\n\u003caside class=\"quote no-group\" data-username=\"slapin\" data-post=\"1\" data-topic=\"3271\"\u003e\n\u003cdiv class=\"title\"\u003e\n\u003cdiv class=\"quote-controls\"\u003e\u003c/div\u003e\n\u003cimg alt=\"\" width=\"20\" height=\"20\" src=\"https://avatars.discourse-cdn.com/v4/letter/s/dfb087/40.png\" class=\"avatar\"\u003e slapin:\u003c/div\u003e\n\u003cblockquote\u003e\n\u003cp\u003eJust make your ugly models with ugly animations\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003c/aside\u003e\n\u003cp\u003eHuh, yes, this is the best item in the list. It took me a lot of time to understand why I can’t just steal nice assets from other games and make my one.\u003c/p\u003e","post_number":2,"post_type":1,"updated_at":"2017-06-21T12:43:38.650Z","reply_count":0,"reply_to_post_number":null,"quote_count":1,"incoming_link_count":0,"reads":52,"readers_count":51,"score":10.4,"yours":false,"topic_id":3271,"topic_slug":"open-world-games","display_username":"Eugene Kozlov","primary_group_name":null,"flair_name":null,"flair_url":null,"flair_bg_color":null,"flair_color":null,"version":1,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"read":true,"user_title":"Core developer","title_is_group":false,"bookmarked":false,"actions_summary":[],"moderator":false,"admin":false,"staff":false,"user_id":484,"hidden":false,"trust_level":2,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":false,"can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false},{"id":18878,"name":"kabu","username":"johnnycable","avatar_template":"/user_avatar/discourse.urho3d.io/johnnycable/{size}/788_2.png","created_at":"2017-06-21T15:09:55.282Z","cooked":"\u003col\u003e\n\u003cli\u003eThe game should be possible to fastrun in under 5 hours. Otherwise the motivation is lost and game left unfinished.\u003cbr\u003e\n–\u0026gt;looks like your friends are not really interested in playing games, just pass an afternoon somewhere/someway (booze?anyone?)\u003c/li\u003e\n\u003cli\u003eIngame text reading should not be required to complete game and get good ending; the reading might be rewarded by extra content or story depth, though.\u003cbr\u003e\n–\u0026gt;looks like your friends hate late 90’ jrpg retrocade. They have a point, but just for the graphics. Can’t your friends read?\u003c/li\u003e\n\u003cli\u003eThe locations should be small enough and should be memorable enough so that additional navigation helpers are not needed. But the tools should still be available. Labyrinths and navugation-based puzzles are the reason to drop game and never come back.\u003cbr\u003e\n–\u0026gt; Never heard of a game called Machinarium? It won many prizes. And yes, I hate puzzles, never had the patience(or the mind), not for me.\u003c/li\u003e\n\u003cli\u003eHUD should not contain directions in text form, nobody reads them, and it is annoying to find-out that directions were written on screen, people don’t like feeling stupid.\u003cbr\u003e\n–\u0026gt;ditto as in 2. How much text can you put into a hud at most?\u003c/li\u003e\n\u003cli\u003eAll puzzles should be tested on various people; most buying audience prefer to skip puzzles. They might be fun as optional gameplay element though. People don’t like feeling stupid. Also youtube will make puzzles useless; randomized puzzles not usable with youtube will make game incompletable for large audience percentage.\u003cbr\u003e\n–\u0026gt;randomizing puzzles can be done. Anyway, what’s this puzzles all about? Puzzles are a specific, particular, very precise category of gaming which has a stable and stubborn following. Not the kind of guys playing FPS, I guess…\u003c/li\u003e\n\u003cli\u003eLong game hours and replayability is a myth; Best games are completed under 5 hours and never played again, with driven and accomplishment feeling; it is too rare to find really replayable game, so why bother.\u003cbr\u003e\n–\u0026gt;And what about impossible games? Flappy something, anyone? The developer received death threats for removing the game from the stores…\u003c/li\u003e\n\u003cli\u003ePlayer likes predictable gameplay; player is quickly tired of predictable gameplay. Don’t torture players, make games short\u003cbr\u003e\n–\u0026gt;looks like your “friends” doesn’t want to play “your” game… My friends and I are playing a lot of games and some in particular since more than 20 years…\u003c/li\u003e\n\u003cli\u003eWhile players say they like challenges, they actually don’t. But they should feel the challenge, even though there isn’t. Also they’are to be rewarded for it by even less challenge. Players don’t like and easily notice “balanced” games; The balance should be a part of game design, not added later. But still, everybody likes powerups as indication there is tough fight nearby, but thisone is too cliched;\u003cbr\u003e\n–\u0026gt; …?\u003cbr\u003e\nsomething new in casual shooters/survival horrors would be highly welcome.\u003cbr\u003e\n–\u0026gt; why? don’t you like killing zombies?\u003c/li\u003e\n\u003cli\u003eIf one does some animations good and some half-assed, it is noticeable by player and is annoying; also it is annoying when good model is animated badly. But if you do everything on the same level, people are happy.\u003cbr\u003e\n–\u0026gt; don’t mix and match minecraft and tekken99 styles. Sounds reasonable.\u003cbr\u003e\nSo if you don’t have enough time for animations don’t bother modelling well. Also don’t buy pre-made great looking models if you can’t make animations required for game. Just make your ugly models with ugly animations. If your plot is good, player will conseder it a part of style, not half-assed job. Especially if you put your soul into it.\u003cbr\u003e\n–\u0026gt;Hope you don’t really put your soul into it by signing into some satanic pact…\u003c/li\u003e\n\u003cli\u003eDon’t bother making any adventure games; they won’t sell. Also if you’re not huge company with a lot of resources, don’t bother with RPGs either. Just do a new casual shooter with new setting, they always sell. Also you save on engine, you don’t need to add new code for a new game.\u003cbr\u003e\n–\u0026gt;Right. Leave it to Square Enix. They will sell.\u003c/li\u003e\n\u003cli\u003eDon’t make gameplay complicated - too many possibilities will make game too scary for players. There is very little players who like a lot of controls.\u003cbr\u003e\n–\u0026gt;Looks like your friends are a bit dumb. Me too. All those swipes… up, down… aaghhh gestures!\u003cimg src=\"https://emoji.discourse-cdn.com/twitter/fearful.png?v=5\" title=\":fearful:\" class=\"emoji\" alt=\":fearful:\"\u003e\u003cbr\u003e\nAlso large worlds have the same effect. And people hate walking simulators.\u003cbr\u003e\n–\u0026gt;One of preferred occupation of the elder scroll series, as reported by player, is just going around the world, not caring about the main quest at all.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eGenerally speaking, I’d give your friend some new kind of candy crush. Don’t bother doing car simulators…\u003cbr\u003e\nOr you could put a hud in the form of a car cockpit with a windscreen with candy crush saga on it in place of the roads… candy crush: driving loving.\u003c/p\u003e","post_number":3,"post_type":1,"updated_at":"2017-06-21T15:09:55.282Z","reply_count":0,"reply_to_post_number":null,"quote_count":0,"incoming_link_count":0,"reads":48,"readers_count":47,"score":9.6,"yours":false,"topic_id":3271,"topic_slug":"open-world-games","display_username":"kabu","primary_group_name":null,"flair_name":null,"flair_url":null,"flair_bg_color":null,"flair_color":null,"version":1,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"read":true,"user_title":null,"bookmarked":false,"actions_summary":[],"moderator":false,"admin":false,"staff":false,"user_id":660,"hidden":false,"trust_level":2,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":false,"can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false},{"id":18879,"name":"","username":"slapin","avatar_template":"https://avatars.discourse-cdn.com/v4/letter/s/dfb087/{size}.png","created_at":"2017-06-21T16:49:36.767Z","cooked":"\u003cp\u003eWell, I asked 6 people in age from 14 to 21, which is I think 99% of market.\u003cbr\u003e\nThese are casual gamers, not kind of pros, they generally have their lifes except for games\u003cbr\u003e\nand play games among other entertainments. The list is generalized opinion, not someone’s specific.\u003cbr\u003e\nFor most things I see the same opinions displayed on forums. BTW, for Elder Scrolls -\u003cbr\u003e\nit looks like most popular of series are Oblivion and Skyrim, though they consider Morrowind \"true\"\u003cbr\u003e\nbut not really fun to play. Which is contrary to my opinion (I’m fun of first 3 parts of series).\u003cbr\u003e\nAnyway, these are the ones who buy games and give $$$. You can go hard path and try to give them something new\u003cbr\u003e\nwhich is extremely risky, or go via least resistance path and give them another corridor shooter “with RPG elements” they like, and rise some “easy” $$$. If price is right, that will keep you afloat while you develop something which\u003cbr\u003e\nis you do for yourself, not an audience.\u003c/p\u003e","post_number":4,"post_type":1,"updated_at":"2017-06-21T16:49:36.767Z","reply_count":1,"reply_to_post_number":null,"quote_count":0,"incoming_link_count":0,"reads":42,"readers_count":41,"score":13.4,"yours":false,"topic_id":3271,"topic_slug":"open-world-games","display_username":"","primary_group_name":null,"flair_name":null,"flair_url":null,"flair_bg_color":null,"flair_color":null,"version":1,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"read":true,"user_title":null,"bookmarked":false,"actions_summary":[],"moderator":false,"admin":false,"staff":false,"user_id":554,"hidden":false,"trust_level":2,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":false,"can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false},{"id":18886,"name":"Konstantin Tomashevich","username":"KonstantTom","avatar_template":"/user_avatar/discourse.urho3d.io/konstanttom/{size}/203_2.png","created_at":"2017-06-21T20:04:29.667Z","cooked":"\u003caside class=\"quote no-group\" data-username=\"slapin\" data-post=\"4\" data-topic=\"3271\"\u003e\n\u003cdiv class=\"title\"\u003e\n\u003cdiv class=\"quote-controls\"\u003e\u003c/div\u003e\n\u003cimg alt=\"\" width=\"20\" height=\"20\" src=\"https://avatars.discourse-cdn.com/v4/letter/s/dfb087/40.png\" class=\"avatar\"\u003e slapin:\u003c/div\u003e\n\u003cblockquote\u003e\n\u003cp\u003eI asked 6 people in age from 14 to 21, which is I think 99% of market.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003c/aside\u003e\n\u003cp\u003eI think, even if you ask \u003cstrong\u003e10 000\u003c/strong\u003e people, it will not be realistic image of market. So, 6 people is not enough anyways.\u003c/p\u003e\n\u003caside class=\"quote no-group\" data-username=\"slapin\" data-post=\"4\" data-topic=\"3271\"\u003e\n\u003cdiv class=\"title\"\u003e\n\u003cdiv class=\"quote-controls\"\u003e\u003c/div\u003e\n\u003cimg alt=\"\" width=\"20\" height=\"20\" src=\"https://avatars.discourse-cdn.com/v4/letter/s/dfb087/40.png\" class=\"avatar\"\u003e slapin:\u003c/div\u003e\n\u003cblockquote\u003e\n\u003cp\u003eor go via least resistance path and give them another corridor shooter “with RPG elements” they like, and rise some “easy” $$$\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003c/aside\u003e\n\u003cp\u003eAsk yourself, why people should buy \u003cstrong\u003eyour\u003c/strong\u003e shooter? Why they should choose \u003cstrong\u003eyour\u003c/strong\u003e shooter from \u003cstrong\u003ebillion\u003c/strong\u003e another ones? Why they should buy any shooter when they can continue playing their favorite game? In most cases they will choose Overwatch or any other popular shooter which was published by a big company. IMHO, there is no sense to develop new GTA or DOTA because most players won’t go to your new clone.\u003c/p\u003e","post_number":5,"post_type":1,"updated_at":"2017-06-21T20:04:29.667Z","reply_count":1,"reply_to_post_number":4,"quote_count":1,"incoming_link_count":0,"reads":41,"readers_count":40,"score":13.2,"yours":false,"topic_id":3271,"topic_slug":"open-world-games","display_username":"Konstantin Tomashevich","primary_group_name":null,"flair_name":null,"flair_url":null,"flair_bg_color":null,"flair_color":null,"version":1,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"read":true,"user_title":null,"bookmarked":false,"actions_summary":[],"moderator":false,"admin":false,"staff":false,"user_id":333,"hidden":false,"trust_level":2,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":false,"can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false},{"id":18887,"name":"kabu","username":"johnnycable","avatar_template":"/user_avatar/discourse.urho3d.io/johnnycable/{size}/788_2.png","created_at":"2017-06-21T20:52:39.127Z","cooked":"\u003cp\u003eSome demographics:\u003cbr\u003e\n10-25 lowest payers, unaffiliated mostly, very casual, difficult market\u003cbr\u003e\n25-45 best payers, got a job, probably affiliated, best market\u003cbr\u003e\n45-65 so-so, looks getting old makes you loose interest in gaming\u003cbr\u003e\nthis is it, more or less. catering to a too much young/old audience is not rewarding.\u003c/p\u003e\n\u003cp\u003eOther demographics:\u003cbr\u003e\ncore player: those who spend money for the kind of game they like, has friends like them, expect quality\u003cbr\u003e\ncasual player: playing sometimes when commuting on mobile, can spend if they feel so, do not expect quality\u003cbr\u003e\nhalfbreed: after mobile revolution, all those people who started from casual and to a passion to some kind of game. candy crush guys, who play all candy crush clones, from time to time. strangely enough, these are the guys who spend most.\u003c/p\u003e\n\u003cp\u003eSelling to kids is by far the most difficult thing. They don’t have a job, they don’t have money, except when they’re rich kids…\u003c/p\u003e","post_number":6,"post_type":1,"updated_at":"2017-06-21T20:52:39.127Z","reply_count":2,"reply_to_post_number":null,"quote_count":0,"incoming_link_count":0,"reads":40,"readers_count":39,"score":18.0,"yours":false,"topic_id":3271,"topic_slug":"open-world-games","display_username":"kabu","primary_group_name":null,"flair_name":null,"flair_url":null,"flair_bg_color":null,"flair_color":null,"version":1,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"read":true,"user_title":null,"bookmarked":false,"actions_summary":[],"moderator":false,"admin":false,"staff":false,"user_id":660,"hidden":false,"trust_level":2,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":false,"can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false},{"id":18891,"name":"","username":"slapin","avatar_template":"https://avatars.discourse-cdn.com/v4/letter/s/dfb087/{size}.png","created_at":"2017-06-21T22:28:49.571Z","cooked":"\u003cp\u003eWell, 10-25 get most games, as they have a lot of free time and no family to feed.\u003cbr\u003e\n25-45 start to (almost) feed themselves, but have more widespread interest than gaming and actually play less.\u003cbr\u003e\nAlso they have higher demands on various genres, they have more widespread tastes and less predictable.\u003cbr\u003e\nBasically “I buy only AAA” audience belongs to 10-25 range, while 25-45 wants more adult and mature\u003cbr\u003e\nplots, require better overall quality, they also buy games themselves with hard earned money, not summer work savings.\u003cbr\u003e\nIf targeting, I’d suggest 10-25 audience, as they are biggest market (I’d say 90%).and much more predictable.\u003c/p\u003e","post_number":7,"post_type":1,"updated_at":"2017-06-21T22:28:49.571Z","reply_count":0,"reply_to_post_number":6,"quote_count":0,"incoming_link_count":0,"reads":38,"readers_count":37,"score":7.6,"yours":false,"topic_id":3271,"topic_slug":"open-world-games","display_username":"","primary_group_name":null,"flair_name":null,"flair_url":null,"flair_bg_color":null,"flair_color":null,"version":1,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"read":true,"user_title":null,"reply_to_user":{"username":"johnnycable","name":"kabu","avatar_template":"/user_avatar/discourse.urho3d.io/johnnycable/{size}/788_2.png"},"bookmarked":false,"actions_summary":[],"moderator":false,"admin":false,"staff":false,"user_id":554,"hidden":false,"trust_level":2,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":false,"can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false},{"id":18892,"name":"","username":"slapin","avatar_template":"https://avatars.discourse-cdn.com/v4/letter/s/dfb087/{size}.png","created_at":"2017-06-21T22:36:14.402Z","cooked":"\u003cp\u003eYou count it all wrong. You make stuff which is the same as anyone else’s stuff. So you should count in probabilities.\u003cbr\u003e\nIn high-concurrency situations you just try to get what you can. Look how mobile app developers do.\u003cbr\u003e\nThey don’t try to innovate at all, they do the same thing again and again and get their share of $$$.\u003cbr\u003e\nIn general, if your game is not heavily half./full assed, you will get sales. And making another GTA or DOTA will\u003cbr\u003e\ngive you your bread and butter. If you aim for millions and innovations you probably in wrong market. Or you’re the one who will be eventually praised by others who will fillow you and succeed where you failed.\u003c/p\u003e","post_number":8,"post_type":1,"updated_at":"2017-06-21T22:36:14.402Z","reply_count":0,"reply_to_post_number":5,"quote_count":0,"incoming_link_count":0,"reads":38,"readers_count":37,"score":7.6,"yours":false,"topic_id":3271,"topic_slug":"open-world-games","display_username":"","primary_group_name":null,"flair_name":null,"flair_url":null,"flair_bg_color":null,"flair_color":null,"version":1,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"read":true,"user_title":null,"reply_to_user":{"username":"KonstantTom","name":"Konstantin Tomashevich","avatar_template":"/user_avatar/discourse.urho3d.io/konstanttom/{size}/203_2.png"},"bookmarked":false,"actions_summary":[],"moderator":false,"admin":false,"staff":false,"user_id":554,"hidden":false,"trust_level":2,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":false,"can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false},{"id":18893,"name":"","username":"slapin","avatar_template":"https://avatars.discourse-cdn.com/v4/letter/s/dfb087/{size}.png","created_at":"2017-06-21T22:40:49.962Z","cooked":"\u003cp\u003ebtw, people in their 4-s do not differ much than people in 30s. Playing games IS waste of time however you look at it and if you have better use for your time, you wont play games at any age, It is the same kind of entertainment\u003cbr\u003e\nas TV. So if you’re 30 and playing games 2 hour on Saturdays, that is as normal as being 12 and playing games 80 hours per week. And quality is generally the same.\u003c/p\u003e","post_number":9,"post_type":1,"updated_at":"2017-06-21T22:40:49.962Z","reply_count":1,"reply_to_post_number":6,"quote_count":0,"incoming_link_count":0,"reads":37,"readers_count":36,"score":12.4,"yours":false,"topic_id":3271,"topic_slug":"open-world-games","display_username":"","primary_group_name":null,"flair_name":null,"flair_url":null,"flair_bg_color":null,"flair_color":null,"version":1,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"read":true,"user_title":null,"reply_to_user":{"username":"johnnycable","name":"kabu","avatar_template":"/user_avatar/discourse.urho3d.io/johnnycable/{size}/788_2.png"},"bookmarked":false,"actions_summary":[],"moderator":false,"admin":false,"staff":false,"user_id":554,"hidden":false,"trust_level":2,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":false,"can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false},{"id":18897,"name":"kabu","username":"johnnycable","avatar_template":"/user_avatar/discourse.urho3d.io/johnnycable/{size}/788_2.png","created_at":"2017-06-22T10:28:22.925Z","cooked":"\u003cp\u003eMan, between 30 and 40 there’s a chasm. How old are you?\u003cimg src=\"https://emoji.discourse-cdn.com/twitter/wink.png?v=5\" title=\":wink:\" class=\"emoji\" alt=\":wink:\"\u003e\u003c/p\u003e","post_number":10,"post_type":1,"updated_at":"2017-06-22T10:28:22.925Z","reply_count":1,"reply_to_post_number":9,"quote_count":0,"incoming_link_count":0,"reads":34,"readers_count":33,"score":11.8,"yours":false,"topic_id":3271,"topic_slug":"open-world-games","display_username":"kabu","primary_group_name":null,"flair_name":null,"flair_url":null,"flair_bg_color":null,"flair_color":null,"version":1,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"read":true,"user_title":null,"reply_to_user":{"username":"slapin","name":"","avatar_template":"https://avatars.discourse-cdn.com/v4/letter/s/dfb087/{size}.png"},"bookmarked":false,"actions_summary":[],"moderator":false,"admin":false,"staff":false,"user_id":660,"hidden":false,"trust_level":2,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":false,"can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false},{"id":18905,"name":"","username":"slapin","avatar_template":"https://avatars.discourse-cdn.com/v4/letter/s/dfb087/{size}.png","created_at":"2017-06-22T13:39:42.902Z","cooked":"\u003cp\u003eI’m on other side of the chasm \u003cimg src=\"https://emoji.discourse-cdn.com/twitter/slight_smile.png?v=5\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\"\u003e\u003c/p\u003e","post_number":11,"post_type":1,"updated_at":"2017-06-22T13:39:42.902Z","reply_count":1,"reply_to_post_number":10,"quote_count":0,"incoming_link_count":0,"reads":34,"readers_count":33,"score":11.8,"yours":false,"topic_id":3271,"topic_slug":"open-world-games","display_username":"","primary_group_name":null,"flair_name":null,"flair_url":null,"flair_bg_color":null,"flair_color":null,"version":1,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"read":true,"user_title":null,"reply_to_user":{"username":"johnnycable","name":"kabu","avatar_template":"/user_avatar/discourse.urho3d.io/johnnycable/{size}/788_2.png"},"bookmarked":false,"actions_summary":[],"moderator":false,"admin":false,"staff":false,"user_id":554,"hidden":false,"trust_level":2,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":false,"can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false},{"id":18910,"name":"kabu","username":"johnnycable","avatar_template":"/user_avatar/discourse.urho3d.io/johnnycable/{size}/788_2.png","created_at":"2017-06-22T17:12:18.588Z","cooked":"\u003cp\u003eyoungsters! \u003cimg src=\"https://emoji.discourse-cdn.com/twitter/grin.png?v=5\" title=\":grin:\" class=\"emoji\" alt=\":grin:\"\u003e ahhggh! \u003cimg src=\"https://emoji.discourse-cdn.com/twitter/grin.png?v=5\" title=\":grin:\" class=\"emoji\" alt=\":grin:\"\u003e\u003c/p\u003e","post_number":12,"post_type":1,"updated_at":"2017-06-22T17:12:18.588Z","reply_count":0,"reply_to_post_number":11,"quote_count":0,"incoming_link_count":0,"reads":33,"readers_count":32,"score":6.6,"yours":false,"topic_id":3271,"topic_slug":"open-world-games","display_username":"kabu","primary_group_name":null,"flair_name":null,"flair_url":null,"flair_bg_color":null,"flair_color":null,"version":1,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"read":true,"user_title":null,"reply_to_user":{"username":"slapin","name":"","avatar_template":"https://avatars.discourse-cdn.com/v4/letter/s/dfb087/{size}.png"},"bookmarked":false,"actions_summary":[],"moderator":false,"admin":false,"staff":false,"user_id":660,"hidden":false,"trust_level":2,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":false,"can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false},{"id":18912,"name":"","username":"slapin","avatar_template":"https://avatars.discourse-cdn.com/v4/letter/s/dfb087/{size}.png","created_at":"2017-06-22T19:58:23.717Z","cooked":"\u003cp\u003eYeah, at 30s I was feeling much older\u003c/p\u003e","post_number":13,"post_type":1,"updated_at":"2017-06-22T19:58:23.717Z","reply_count":0,"reply_to_post_number":null,"quote_count":0,"incoming_link_count":1,"reads":32,"readers_count":31,"score":11.4,"yours":false,"topic_id":3271,"topic_slug":"open-world-games","display_username":"","primary_group_name":null,"flair_name":null,"flair_url":null,"flair_bg_color":null,"flair_color":null,"version":1,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"read":true,"user_title":null,"bookmarked":false,"actions_summary":[],"moderator":false,"admin":false,"staff":false,"user_id":554,"hidden":false,"trust_level":2,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":false,"can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false}],"stream":[18865,18875,18878,18879,18886,18887,18891,18892,18893,18897,18905,18910,18912]},"timeline_lookup":[[1,1981],[5,1980],[12,1979]],"suggested_topics":[{"id":7304,"title":"Urho3D is crashing on Android 12","fancy_title":"Urho3D is crashing on Android 12","slug":"urho3d-is-crashing-on-android-12","posts_count":1,"reply_count":0,"highest_post_number":1,"image_url":null,"created_at":"2022-07-28T10:03:51.280Z","last_posted_at":"2022-07-28T10:03:51.349Z","bumped":true,"bumped_at":"2022-07-28T10:38:06.014Z","archetype":"regular","unseen":false,"pinned":false,"unpinned":null,"visible":true,"closed":false,"archived":false,"bookmarked":null,"liked":null,"tags_descriptions":{},"like_count":1,"views":126,"category_id":9,"featured_link":null,"has_accepted_answer":false,"posters":[{"extras":"latest single","description":"Original Poster, Most Recent Poster","user":{"id":809,"username":"elix22","name":"","avatar_template":"/user_avatar/discourse.urho3d.io/elix22/{size}/1437_2.png"}}]},{"id":7344,"title":"Do we give up supporting dx11？","fancy_title":"Do we give up supporting dx11？","slug":"do-we-give-up-supporting-dx11","posts_count":3,"reply_count":1,"highest_post_number":3,"image_url":null,"created_at":"2022-11-03T09:37:37.893Z","last_posted_at":"2022-11-03T13:09:15.153Z","bumped":true,"bumped_at":"2022-11-03T15:28:58.128Z","archetype":"regular","unseen":false,"pinned":false,"unpinned":null,"visible":true,"closed":false,"archived":false,"bookmarked":null,"liked":null,"tags_descriptions":{},"like_count":0,"views":78,"category_id":9,"featured_link":null,"has_accepted_answer":false,"posters":[{"extras":"latest","description":"Original Poster, Most Recent Poster","user":{"id":1510,"username":"SoNewBee","name":"So New Bee","avatar_template":"/user_avatar/discourse.urho3d.io/sonewbee/{size}/3755_2.png"}},{"extras":null,"description":"Frequent Poster","user":{"id":263,"username":"1vanK","name":"","avatar_template":"/user_avatar/discourse.urho3d.io/1vank/{size}/768_2.png"}}]},{"id":7347,"title":"How does Urho handle script objects each frame?","fancy_title":"How does Urho handle script objects each frame?","slug":"how-does-urho-handle-script-objects-each-frame","posts_count":3,"reply_count":1,"highest_post_number":3,"image_url":null,"created_at":"2022-11-08T02:33:56.461Z","last_posted_at":"2022-11-08T14:46:09.857Z","bumped":true,"bumped_at":"2022-11-08T14:46:09.857Z","archetype":"regular","unseen":false,"pinned":false,"unpinned":null,"visible":true,"closed":false,"archived":false,"bookmarked":null,"liked":null,"tags_descriptions":{},"like_count":0,"views":64,"category_id":9,"featured_link":null,"has_accepted_answer":false,"posters":[{"extras":"latest","description":"Original Poster, Most Recent Poster","user":{"id":1292,"username":"evolgames","name":"evol","avatar_template":"/user_avatar/discourse.urho3d.io/evolgames/{size}/3169_2.png"}},{"extras":null,"description":"Frequent Poster","user":{"id":628,"username":"SirNate0","name":"SirNate0","avatar_template":"https://avatars.discourse-cdn.com/v4/letter/s/9f8e36/{size}.png"}}]},{"id":7221,"title":"While ParticleEmitter emitting how can i change color?","fancy_title":"While ParticleEmitter emitting how can i change color?","slug":"while-particleemitter-emitting-how-can-i-change-color","posts_count":7,"reply_count":4,"highest_post_number":8,"image_url":null,"created_at":"2022-03-18T15:49:19.164Z","last_posted_at":"2022-03-20T10:51:58.767Z","bumped":true,"bumped_at":"2022-03-20T10:51:58.767Z","archetype":"regular","unseen":false,"pinned":false,"unpinned":null,"visible":true,"closed":false,"archived":false,"bookmarked":null,"liked":null,"tags_descriptions":{},"like_count":0,"views":196,"category_id":14,"featured_link":null,"has_accepted_answer":false,"posters":[{"extras":"latest","description":"Original Poster, Most Recent Poster","user":{"id":1503,"username":"tianlv777","name":"zerrrrr","avatar_template":"https://avatars.discourse-cdn.com/v4/letter/t/a4c791/{size}.png"}},{"extras":null,"description":"Frequent Poster","user":{"id":628,"username":"SirNate0","name":"SirNate0","avatar_template":"https://avatars.discourse-cdn.com/v4/letter/s/9f8e36/{size}.png"}}]},{"id":7107,"title":"Error: SDL/SDL_gamecontroller.h: No such file or directory #include \u003cSDL/SDL_gamecontroller.h\u003e","fancy_title":"Error: SDL/SDL_gamecontroller.h: No such file or directory #include \u0026lt;SDL/SDL_gamecontroller.h\u0026gt;","slug":"error-sdl-sdl-gamecontroller-h-no-such-file-or-directory-include-sdl-sdl-gamecontroller-h","posts_count":6,"reply_count":1,"highest_post_number":6,"image_url":null,"created_at":"2021-12-21T15:29:52.810Z","last_posted_at":"2021-12-22T15:32:44.818Z","bumped":true,"bumped_at":"2021-12-22T15:32:44.818Z","archetype":"regular","unseen":false,"pinned":false,"unpinned":null,"visible":true,"closed":false,"archived":false,"bookmarked":null,"liked":null,"tags_descriptions":{},"like_count":3,"views":271,"category_id":10,"featured_link":null,"has_accepted_answer":true,"posters":[{"extras":"latest","description":"Original Poster, Most Recent Poster","user":{"id":1497,"username":"timob256","name":"","avatar_template":"https://avatars.discourse-cdn.com/v4/letter/t/b782af/{size}.png"}},{"extras":null,"description":"Frequent Poster, Accepted Answer","user":{"id":628,"username":"SirNate0","name":"SirNate0","avatar_template":"https://avatars.discourse-cdn.com/v4/letter/s/9f8e36/{size}.png"}}]}],"tags_descriptions":{},"id":3271,"title":"Open-world games","fancy_title":"Open-world games","posts_count":13,"created_at":"2017-06-20T22:33:10.464Z","views":1070,"reply_count":7,"like_count":0,"last_posted_at":"2017-06-22T19:58:23.717Z","visible":true,"closed":false,"archived":false,"has_summary":false,"archetype":"regular","slug":"open-world-games","category_id":9,"word_count":2402,"deleted_at":null,"user_id":554,"featured_link":null,"pinned_globally":false,"pinned_at":null,"pinned_until":null,"image_url":null,"slow_mode_seconds":0,"draft":null,"draft_key":"topic_3271","draft_sequence":null,"unpinned":null,"pinned":false,"current_post_number":1,"highest_post_number":13,"deleted_by":null,"actions_summary":[{"id":4,"count":0,"hidden":false,"can_act":false},{"id":8,"count":0,"hidden":false,"can_act":false},{"id":7,"count":0,"hidden":false,"can_act":false}],"chunk_size":20,"bookmarked":false,"bookmarks":[],"topic_timer":null,"message_bus_last_id":0,"participant_count":4,"show_read_indicator":false,"thumbnails":null,"slow_mode_enabled_until":null,"tags_disable_ads":false,"details":{"can_edit":false,"notification_level":1,"participants":[{"id":554,"username":"slapin","name":"","avatar_template":"https://avatars.discourse-cdn.com/v4/letter/s/dfb087/{size}.png","post_count":7,"primary_group_name":null,"flair_name":null,"flair_url":null,"flair_color":null,"flair_bg_color":null,"trust_level":2},{"id":660,"username":"johnnycable","name":"kabu","avatar_template":"/user_avatar/discourse.urho3d.io/johnnycable/{size}/788_2.png","post_count":4,"primary_group_name":null,"flair_name":null,"flair_url":null,"flair_color":null,"flair_bg_color":null,"trust_level":2},{"id":333,"username":"KonstantTom","name":"Konstantin Tomashevich","avatar_template":"/user_avatar/discourse.urho3d.io/konstanttom/{size}/203_2.png","post_count":1,"primary_group_name":null,"flair_name":null,"flair_url":null,"flair_color":null,"flair_bg_color":null,"trust_level":2},{"id":484,"username":"Eugene","name":"Eugene Kozlov","avatar_template":"/user_avatar/discourse.urho3d.io/eugene/{size}/902_2.png","post_count":1,"primary_group_name":null,"flair_name":null,"flair_url":null,"flair_color":null,"flair_bg_color":null,"trust_level":2}],"created_by":{"id":554,"username":"slapin","name":"","avatar_template":"https://avatars.discourse-cdn.com/v4/letter/s/dfb087/{size}.png"},"last_poster":{"id":554,"username":"slapin","name":"","avatar_template":"https://avatars.discourse-cdn.com/v4/letter/s/dfb087/{size}.png"}}}